 DECLARE @A INT = 2
 PRINT @A
 SET @A=4
 PRINT @a
----------------------
USE [C:\REPO\PROJECT\SQL\SKILLDB.MDF] 

  
CREATE TABLE MyFriends
(
	-- Ключевое слово IDENTITY задает начальное значение и устанавливает авто инкремент.
	-- По умолчанию значение первой ячейки равно 1 и с каждой новой записью увеличивается на 1.
	FriendId smallint IDENTITY NOT NULL,
	FirstName Varchar(20) NOT NULL,
	LastName Varchar(20) NULL,
	BirthDate date NULL,
	PhoneNumber char(10) NOT NULL
)
GO -- Конец пакета инструкций.

	EXEC sp_help MyFriends

	SELECT * FROM MyFrends mf

GO
-------------------------------------------------------------------------
				/* Оператор вставки INSERT */
-------------------------------------------------------------------------

-- Записываем строку в таблицу MyFreand
INSERT INTO MyFriends    -- Ключевое слово INTO можно не использовать.
(FstName, BthDate, Ntel) -- Указание порядка записи данных.
VALUES
('Max', 'Petrov', '02/03/1988', '093*******'); -- Вводимые данные.
GO
-------------------------------------------------------------------------

-- Можно явно изменить порядок записываемых даных.
INSERT INTO MyFriends
(LstName, FstName, BthDate, Ntel) -- Указание порядка записи данных.
VALUES
('Martinov', 'Kostya', '01/03/1986', '097*******'); -- Вводимые данные.
GO
-------------------------------------------------------------------------

INSERT INTO MyFriends
 -- Указание порядка записи данных отсутствует, значит используем порядок по умолчанию.
VALUES
('Vitia', 'Sokolov', '01/03/1986', '095*******'); -- Вводимые данные.
GO
-------------------------------------------------------------------------

INSERT INTO MyFriends
 -- Указание порядка записи данных отсутствует, значит используем порядок по умолчанию.
VALUES
('Sokolov', 'Vitia', '01/03/1986', '095*******'); -- Вводимые данные (Ошибка очередности ввода!).
GO

SELECT * FROM MyFriends
-------------------------------------------------------------------------

INSERT INTO MyFriends
VALUES 
 -- Нельзя оставлять пустыми поля помеченные ограничением NOT NULL
(NULL, 'Imelianov', '01/03/1986', '095*******'); -- Вводимые данные.
GO
-------------------------------------------------------------------------

INSERT INTO MyFriends
VALUES
-- Допускается оставлять пустыми поля помеченные ограничением NULL 
('Vitia', null, '01/03/1986', '095*******'); -- Вводимые данные.
GO
-------------------------------------------------------------------------

INSERT INTO MyFriends
(FstName,LstName,BthDate,Ntel) 
VALUES -- Начиная с 2008 SQL, допускается вводить несколько строк одновременно
('Max', 'Petrov', '02/21/1988', '093*******'),
('Alex', 'Vare', '03/20/1990', '093*******'),
('Sergei', 'Smolnikov', '05/31/1991', '093*******'),
('Petr', 'Vitiushkin', '03/06/1989', '093*******')
GO
-------------------------------------------------------------------------

INSERT INTO MyFriends
-- Указание порядка записи данных для несколиких строк не обязательно
VALUES
('Max', 'Petrov', '02/21/1988', '093*******'),
('Alex', 'Vare', '03/20/1990', '093*******'),
('Sergei', 'Smolnikov', '05/31/1991', '093*******'),
('Petr', 'Vitiushkin', '03/06/1989', '093*******');
GO




